/* drivers/input/keyboard/lge_touch_driver.c
 *
 * Copyright (C) 2011 LGE. 
 * 
 * Writer: yehan.ahn@lge.com
 *
 * Most lines are copied from touch_driver of STAR-P999.
 * That is written by joseph.jung@lge.com and taewan.kim@lge.com.
 * Please check the STAR-P999 or contact writers if you want more information about original source code.
 *
 * This file is used by LGE_touch_deriver.c.
 * it is related with specific touch-device.
 * You should check the document or contact the writer in order to understand whole process.
 *
 * This software is licensed under the terms of the GNU General Public
 * License version 2, as published by the Free Software Foundation, and
 * may be copied, distributed, and modified under those terms.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 */
#include <linux/module.h>
#include <linux/delay.h>
#include <linux/earlysuspend.h>
#include <linux/hrtimer.h>
#include <linux/i2c.h>
#include <linux/input.h>
#include <linux/kthread.h>
#include <linux/interrupt.h>
#include <linux/io.h>
#include <linux/slab.h>
#include <linux/platform_device.h>
#include <mach/gpio.h>
#include <linux/semaphore.h>
#include <linux/irq.h>
#include <linux/freezer.h>

#include <linux/input/lge_touch_synaptics.h>
#include <linux/input/lge_touch_driver.h>

struct touch_device_caps
{
    bool 	IsMultiTouchSupported; // single touch[0] / multi-touch[1]
    bool	IsButtonSupported; // yes[1] / no[0]
    u32 	MaxNumberOfFingerCoordReported;
    bool	IsRelativeDataSupported; // support[1] / not[0]
    u32 	MaxNumberOfRelativeCoordReported;
    u32 	MaxNumberOfWidthReported;
    u32 	MaxNumberOfPressureReported;
    u32 	Gesture;
    bool 	IsWidthSupported;
    bool 	IsPressureSupported;
    bool 	IsFingersSupported;
    u32 	XMinPosition;
    u32 	YMinPosition;
    u32 	XMaxPosition;
    u32 	YMaxPosition;
    u32 	Orientation;
};

struct synaptics_ts_data {
	struct touch_device_caps caps;
	struct i2c_client *client;
	struct input_dev *input_dev;
	struct semaphore sem;
	struct task_struct*	task;
	u32 gpio;
	u32 irq_gpio;
	u32 flags;
	u32 reset;
	u32 touch;
	int (*power)(int on);	
};

struct ts_sensor_data
{
	u8 device_status_reg;						//0x13
	u8 interrupt_status_reg;					//0x14
	u8 finger_state_reg[3];						//0x15~0x17

	u8 fingers_data[SYNAPTICS_FINGER_MAX][5];				//0x18 ~ 0x49

	u8 gesture_flag0;							//0x4A
	u8 gesture_flag1;							//0x4B
	u8 pinch_motion_X_flick_distance;			//0x4C
	u8 rotation_motion_Y_flick_distance;		//0x4D
	u8 finger_separation_flick_time;			//0x4E
};

static const struct touch_device_caps Synaptics_Capabilities =
{
	1,	//IsMultiTouchSupported
	1, 	//isButtonSupported
	10,	//MaxNumberOfFingerCoordReported;
	0,	//IsRelativeDataSupported
	0,	//MaxNumberOfRelativeCoordReported
	15,	//MaxNumberOfWidthReported
	0xFF,	//MaxNumberOfPressureReported
	0,	// Gesture
	0,	//IsWidthSupported
	0,	//IsPressureSupported, mandatory for multi-touch
	0,	//IsFingersSupported
	0,	//XMinPosition
	0,	//YMinPosition
	LGE_TOUCH_RESOLUTION_X + 1, //XMaxPosition
	LGE_TOUCH_RESOLUTION_Y + 1, //YMaxPosition
	0,
};

struct button_area{
	u8		b_name;
	u16		b_left;
	u16		b_right;
};

static struct ts_sensor_data ts_reg_data={0};



#define GET_BIT_MASK(_finger_state_reg)	\
		(_finger_state_reg[2] & 0x04)<<7 | (_finger_state_reg[2] & 0x01)<<8 |	\
		(_finger_state_reg[1] & 0x40)<<1 | (_finger_state_reg[1] & 0x10)<<2 |(_finger_state_reg[1] & 0x04)<<3 | (_finger_state_reg[1] & 0x01)<<4 |	\
